app/controllers/reviews_controller.rb

  def create
    @review = Review.new(review_params)
    @review.user_id = current_user.id
    @review.movie_id = @movie.id
    respond_to do |format|
      if @review.save
---
INSERT INTO "reviews" ("rating", "comment", "created_at", "updated_at", "user_id", "movie_id") VALUES (?, ?, ?, ?, ?, ?)  [["rating", 5], ["comment", "kkbskdfksdf"], ["created_at", "2020-06-06 05:39:40.487273"], ["updated_at", "2020-06-06 05:39:40.487273"], ["user_id", 1], ["movie_id", 8]]